In [ ]:
from IPython.core.display import HTML
HTML('''
<script>
var logoParent = document.getElementById("kernel_logo_widget")
var logo = document.getElementById("kernel_logo_widget").getElementsByClassName("current_kernel_logo")[0];
logo.src = "https://i.ibb.co/mD4jTGQ/itclogo.jpg";
logo.style = "display: inline; width:138px; height:40px";
logoParent.innerHTML = '<a href="https://i.ibb.co/mD4jTGQ/itclogo.jpg">' + logoParent.innerHTML + '</a>';
</script>
''')

<font size="36"><b>Pandas - Assignment 2</b></font> <img src = "https://s3-ap-south-1.amazonaws.com/av-blog-media/wp-content/uploads/2018/03/pandas.jpg" height=200 width=200>

In [2]:
import pandas as pd
import numpy as np

# Topic - Strings

## Question 1

Calculate the number of characters in each value in a pandas series in a few ways:
- Using `map` function
- Using `apply` function
- Using built-in Pandas way using `.str` on the Series - the preferred way of working with Strings in Pandas DataFrames

In [19]:
def length(series):
  return len(series)
series_q1 = pd.Series(['This', 'is', 'a', 'string', 'with', 'words'])
Length=map(length,series_q1)
list(Length)

#your code here

[4, 2, 1, 6, 4, 5]

## Question 2

Change the first character of each word to upper case in each word of the given pandas series. 
Do it in 3 different ways:
1. Using built-in functions of `Series.str` - usually the preferred way
1. Using `map` or `apply` without defining your own function / lambda
1. Using `map` or `apply` with defining your own function / lambda

In [20]:
series_q2 = pd.Series(['we', 'are', 'at', 'the', 'campus', 'learning', 'pandas'])
new_series=series_q2.map(lambda x: x[0].upper()+x[1:len(x)])
print(new_series)

0          We
1         Are
2          At
3         The
4      Campus
5    Learning
6      Pandas
dtype: object

## Question 3

Split the string column in a dataframe to form a dataframe with 3 columns named  "STD", "City", and "State" and fix the column names

In [21]:
df_q3 = pd.DataFrame(["STD,City\tState",
"33, Kolkata  West Bengal",
"44, Chennai  Tamil Nadu",
"40, Hyderabad  Telengana",
"80, Bangalore  Karnataka"], columns=['row'])

out = pd.DataFrame(df_q3.row.str.split(' ',2).tolist(),columns=['STD','City','State'])

out.drop(index=0,inplace=True)
out
# Desired Output:
#   STD        City        State
# 0  33     Kolkata  West Bengal
# 1  44     Chennai   Tamil Nadu
# 2  40   Hyderabad    Telengana
# 3  80   Bangalore    Karnataka

#your code here

   STD       City         State
1  33,    Kolkata   West Bengal
2  44,    Chennai    Tamil Nadu
3  40,  Hyderabad     Telengana
4  80,  Bangalore     Karnataka

# Topic - DateTime

## Question 4

Given the following Series with dates, parse them and create a new DataFrame with columns for:
- day of month
- week number
- day of year
- day of week

Hints:
- You can use the `pd.to_datetime` method, or `Series.astype()` to turn the strings to dates
- Use the build-in pandas `Series.dt` attributes and methods

In [22]:
series_q4 = pd.Series(['01 Jan 2019', '02-02-2019', '20150303', '2013/04/04', '2012-05-05', '2013-06-06T12:20'])
#your code here
series_q4 = pd.to_datetime(series_q4)
day_of_month = series_q4.dt.day
list(day_of_month)
week_number = series_q4.dt.week
day_of_year = series_q4.dt.dayofyear
day_of_week = series_q4.dt.dayofweek
data = day_of_month,week_number,day_of_year,day_of_week
df=pd.DataFrame({'day of month':day_of_month,'week number':week_number,'day of year':day_of_year,'day_of_week':day_of_week})
df

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:6: FutureWarning: Series.dt.weekofyear and Series.dt.week have been deprecated.  Please use Series.dt.isocalendar().week instead.

   day of month  week number  day of year  day_of_week
0             1            1            1            1
1             2            5           33            5
2             3           10           62            1
3             4           14           94            3
4             5           18          126            5
5             6           23          157            3

## Question 5

1. Create a `DatetimeIndex` that contains each business day (Monday - Friday) of 2021 and use it to index a pandas series of random numbers.
2. Using the created `DatetimeIndex`, find the **sum** of the values for all the Wednesdays.

Hint: check out `pandas.date_range`

In [23]:
#your code here
import random
arr = []
days = pd.date_range('01-01-2021','31-12-2021',freq='B')
for i in range(0,len(days)):
  n = random.random()
  arr.append(n)
df = pd.DataFrame({'values':arr})
df.set_index(days,inplace=True)
df['wed'] = df.index.weekday
wednesdays = df[df['wed']==2]
print('The Sum is: ',wednesdays['values'].sum())

The Sum is:  23.50997520435072

## Question 6 - bins

Divide the given pandas series of 500 numbers between 0 and 50 (inclusive) into: 
 1. 10 bins based on equal **intervals of values in bin**: 10 bins each of interval of values = 5, like bin with values 0 till 5, 5 to 10 etc. (might not come out exactly since depends on actual random numbers)
 2. 10 bins based on the distribution with equal **number of elements in bin (bucket)**: 10 bins with ~50 elements per bin (might not be exactly 20 since if there are repeating values around the edge of the bin, Pandas will put all the equal values in the same bin)
 
Find a function/functions that splits the numbers into groups.  Don't need to actually create separate groups, but show that the correct split was done in each case (for example by using `value_counts`)

In [24]:
series_q6 = pd.Series(np.random.randint(0, 51, size=500))
series=pd.qcut(series_q6,q=10).value_counts()
print(series)
#your code here

(-0.001, 4.0]    58
(30.4, 36.0]     55
(42.0, 46.0]     50
(36.0, 42.0]     50
(19.0, 25.0]     50
(10.0, 15.0]     50
(4.0, 10.0]      49
(15.0, 19.0]     47
(25.0, 30.4]     46
(46.0, 50.0]     45
dtype: int64

## Question 7 - differences

Calculate the **first** and **second** derivative of a pandas series (difference between consecutive numbers, and the difference between these diffrerences)

In [25]:
series_q7 = pd.Series([1, 2, 5, 9, 18, 25, 32, 34, 55, 60])
a=series_q7.diff
print(a)
#your code here

<bound method Series.diff of 0     1
1     2
2     5
3     9
4    18
5    25
6    32
7    34
8    55
9    60
dtype: int64>

## Question 8 - stacking

Stack two pandas series:
1. Vertically - final shape (10,).  Make sure your index is unique after this operation!
1. Horizontally - final shape (5,2)

In [26]:
series_q8_1 = pd.Series(['a', 'b', 'c', 'd', 'e'])
series_q8_2 = pd.Series([1,2,3,4,5])
#your code here
df = pd.concat([series_q8_1, series_q8_2], axis=0)
print('Stacking Vertically\n\n',df)
df1 = pd.concat([series_q8_1, series_q8_2], axis=1)
print('Stacking Horizontally\n\n',df1)

Stacking Vertically

 0    a
1    b
2    c
3    d
4    e
0    1
1    2
2    3
3    4
4    5
dtype: object
Stacking Horizontally

    0  1
0  a  1
1  b  2
2  c  3
3  d  4
4  e  5

## Question 9 - merging

**In 1 command**:
- Join the two given dataframes by 2 columns (which ones?)
- Do it in a way that only the common rows are kept
- Remove duplicate columns (meaning that all values are the same) to keep only one column.
- For `price` column, give 2 versions of prices with names `price_1` and `price_2`

In [27]:
df_q9_1 = pd.DataFrame({'fruit': ['apple', 'banana', 'orange'] * 3,
                    'weight': ['high', 'medium', 'low'] * 3,
                    'price': np.random.randint(0, 15, 9)})

df_q9_2 = pd.DataFrame({'pazham': ['apple', 'orange', 'pine'] * 2,
                    'kilo': ['high', 'low'] * 3,
                    'price': np.random.randint(0, 15, 6)})

#your code here
df_q9_1.merge(df_q9_2,left_on='fruit',right_on='pazham')

     fruit weight  price_x  pazham  kilo  price_y
0    apple   high        7   apple  high        8
1    apple   high        7   apple   low        2
2    apple   high        4   apple  high        8
3    apple   high        4   apple   low        2
4    apple   high        2   apple  high        8
5    apple   high        2   apple   low        2
6   orange    low        4  orange   low        1
7   orange    low        4  orange  high       14
8   orange    low        6  orange   low        1
9   orange    low        6  orange  high       14
10  orange    low        6  orange   low        1
11  orange    low        6  orange  high       14

## Question 10 - Pivoting and unpivoting

### Question 10a - Unpivoting

If you are not familiar, read about **Pivoting** (moving data to wide format into columns) and **Unpivoting** (moving data to long format where columns are used as new rows)

Unpivot the given pandas dataframe from a wide format to a long format, leaving only the `Name` as the only column that's not unpivoted.

Hint: Explore the `melt` function

In [28]:
df_q10 = pd.DataFrame({'Name': {0: 'Danielle', 1: 'Dani', 2: 'Lior'}, 
                   'Course': {0: 'Masters', 1: 'Graduate', 2: 'Graduate'}, 
                   'Age': {0: 28, 1: 29, 2: 30}}) 
df_q10
df1 = pd.melt(df_q10,id_vars=['Name'],value_vars=['Course','Age'])
df1
#Expected outcome:
#    Name     Variable Value
# 0  Danielle Course   Masters
# 1  Dani     Course   Graduate
# 2  Lior     Course   Graduate
# 3  Danielle Age      28
# 4  Dani     Age      29
# 5  Lior     Age      30

#your code here

       Name variable     value
0  Danielle   Course   Masters
1      Dani   Course  Graduate
2      Lior   Course  Graduate
3  Danielle      Age        28
4      Dani      Age        29
5      Lior      Age        30

### Question 10b - Pivoting

Take the outcome dataframe from Question 10a and return it to **exactly** it's original form (with pivoting)

In [29]:
#your code here
df1.pivot(index="Name", columns=["variable"],values="value")

variable Age    Course
Name
Dani      29  Graduate
Danielle  28   Masters
Lior      30  Graduate

# Topic - Sorting, indexing

## Question 11

Using the dataframe of `cars` from `https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv` 
 1. Print maximum value of the column `EngineSize`.
 2. Print how many cars are there with this value
 3. Get the row number, of the **first instance** of largest value in the column "EngineSize". 
 4. Print the row you got

In [30]:
df=pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')
df
print('max ', df.EngineSize.max())
print(df[df['EngineSize']==5.7].Model)

max  5.7
7     Roadmaster
18      Corvette
Name: Model, dtype: object

## Question 12

Take the 4th largest **unique** **not NaN** `EngineSize` value, and print all the cars with this `EngineSize`

In [31]:
EngineSize=df.iloc[:,11:12].sort_values(by='EngineSize')
print(EngineSize[3:4])

    EngineSize
56         1.3